[SMVRC]
VB010=无
VB011=在系统中设定特定放假的国定假日
VB012=透过此作业设定国定假日, 当使用[系统班别设定]的批次产生行事历时, 会\n自动避开此作业设定的国定假日.
VB013=A. 储存: 当设定完成后需按下储存钮以将变更储存.\nB. 国定假日名称: 设定该假日的名称\nC. 月/日: 指定该假日的日期
VB014=无
[SMXF]
VB010=无
VB011=查询作业画面打印纪录
VB012=当作业画面的[凭证打印]钮按下时, 系统会将该动作纪录至打印纪录中.\n可透过此作业查询使用者打印的纪录.
VB013=查询: 依照一般维护作业使用\n检视:\n  A. 打印者代号姓名: 按下打印凭证钮的使用者\n  B. 打印位置: 客户端计算机IP\n  C. 打印时间: 按下凭证打印钮的时间\n  D. 浏览器版本: 由IE浏览器所自动送出的标记\n  E. 打印名称: 该实做打印凭证功能时系统决定. 预设为[窗体名称][单号]\n  F. 打印内容: 开启该打印画面的URL
VB014=此作业所查询的标的为每次打印动作的纪录. 若要查询特定页面的打印\n纪录, 建议使用[打印记录查询作业]
[STDNUM]
VB010=
VB011=
VB012=
VB013=
VB014=
[SMVC]
VB010=无
VB011=供使用者检视、删除个人讯息内容，无新增、修改功能。
VB012=当使用者对在线某些使用者发布个人讯息后，使用者可透过此作业检视讯\n息内容。
VB013=依照一般维护作业操作流程。
VB014=个人讯息的发布可透过点选主画面右上角的『登入使用者』发布。\n所有使用者皆可针对在线使用者发布个人讯息。
[FunctionLevelMaintain]
VB010=无
VB011=检视 Flow Engine(EasyFlow GP) 系统中所设定的职务核决层级数据，仅\n提供检视，无新增、删除、修改功能。
VB012=若要查询流程设计中职务核决层级数据，可透过「职务核决层级检视作\n业」查询。
VB013=依照一般维护作业操作流程。
VB014=若要新增、删除、修改职务核决层级数据，可至 Flow Engine(EasyFlow \nGP) 系统中做调整。\n\n※此核决层级主要用于流程进行时，当流程设定以职务核决层级来决定下\n一个关卡的处理者时，系统用于判断并产生处理者的依据。
[SMVN]
VB010=无
VB011=事先定义一些常用的部门，以加快搜寻选取部门的速度。
VB012=使用者在某情况下，会有常用的部门，例如：工作性质相关的部门、行政\n部门…之类的；这时就可以使用「常用部门设定作业」来设定这些部门。
VB013=依照一般维护作业操作流程。
VB014=此作业所设定的常用部门为个人所使用。\n目前系统并无使用此设定。
[NaNaAdmin]
VB010=无
VB011=登入流程引擎管理画面入口.
VB012=需由系统登入到流程引擎管理时可透过此连结进入.
VB013=请参阅流程引擎相关说明文件.
VB014=无
[SMWK]
VB010=无
VB011=流程发起者窗体填写送出后，原稿数据匣中即会新增一笔数据，显示其发\n起之流程数据。
VB012=当您想追踪流程时，请点选系统选单上的「原稿数据匣」，系统即会在工\n作区显示您所发起的流程清单及流程状态。
VB013=Step1 点选「个人作业区」后，在系统选单中点鼠标左键一下「原稿数据\n匣」，即可呈现曾经以流程发起者的角色填写送出的流程内容，工作区会\n呈现过滤条件与清单。\nStep2 搜寻可以依照?流程状态?、?流程代号?、?主旨包含?做搜寻，?流程\n状态?又可分为：\n(1)不限定：所有流程状态的流程。\n(2)进行中：此流程尚在签核中。\n(3)已结案：此流程已经签核同意结案。\n(4)已终止：此流程已经签核不同意结案。\n(5)已撤销：此流程以被发起人抽单并停止流程。\n依需要填入条件后按下『过滤』钮即可。\nStep3 直接于清单中点选欲检视项目，即可开启检视作业画面。
VB014=若某流程有发起参考流程，仅有主流程会显示在原稿数据匣中，参考流程\n则不会显示。
[Sample20]
VB010=
VB011=
VB012=
VB013=
VB014=
[SMVE]
VB010=无
VB011=新增、修改或删除在公布栏显示之公开讯息。
VB012=当有讯息要告知系统使用者时，可透过此作业发布讯息。
VB013=依照一般维护作业操作流程。
VB014=由此作业发布的讯息，一般使用者透过系统公告作业检视讯息内容。\n并非所有人皆可看到相同的系统公告，系统公告可由此作业设定发布的对\n象，一般使用者仅能看到对应的公告项目。
[SMVU]
VB010=无
VB011=设定ECP设定密码时的安全原则
VB012=当ECP使用预设的DB验证时, 各使用者可透过[个人设定作业]来设定密码.\n透过此作业可规范使用者输入密码的安全强度.
VB013=1. 查询以及浏览: 相同于一般作业\n2. 新增以及修改:\n   A. 使用者: 直接输入该使用者账号或是开窗选择一合法使用者. 若保持\n     空白表示此笔设定适用未列举的所有使用者.\n  B. 账户比对长度: 设定登入账号的长度. 0表示不限制\n  C. 密码最小长度: 使用者设定密码时的最小长度. 最小为4字符\n  D. 密码最大长度: 使用者设定密码时的最长长度. 最大为20字符\n  E. 只能包含大写字母(A-Z): 若勾选表示所有密码只能包含A-Z\n  F. 只能包含小写字母(a-z): 若勾选表示所有密码只能包含a-z\n  G. 只能包含数字(0-9): 若勾选表示所有密码只能包含0-9\n  H. 密码有效天数: 输入0表示不限制; 若输入一天数, 则使用者密码到期\n     后再登入时系统会导向到密码更改画面.
VB014=1. 此项作业使用[排外]的模式设定; 建议先设定一预设设定后, 根据特殊\n   使用者再行特殊设定\n2. 此项作业的限制仅能针对ECP预设提供的DB验证使用. 若系统有整合\n   现行的SSO验证程序, 则不能使用此作业来规范密码强度
[WEBI2015]
VB010=
VB011=
VB012=
VB013=
VB014=
[Calendar]
VB010=无
VB011=记录使用者的行程，仅提供新增、删除功能。
VB012=当使用者有会议或工作安排时，可于此作业记录行程。
VB013=Step1 点选「个人作业区」后，在系统选单中点鼠标左键一下「个人行事\n历」，即可呈现"个人行事历"作业窗口。\nStep2 点选需排定的日期，点击本日行程右方的新增图形，会出现?新增行\n事历项目?作业窗口，输入相关信息后按下?储存?，这样就新增了一笔新的\n行程数据。\nStep3 若需删除行程数据，按下行程项目右方的删除图形即可。
VB014=行事历类型可藉由『行事历类型设定作业』当中维护。
[SMWD]
VB010=无
VB011=设定流程, 角色, 以及作业画面之间的关系
VB012=当设计完流程, 同步至系统中, 且将作业画面登录到系统后, 管理者可透过\n此作业设定, 将流程, 角色, 以及作业画面做关联, 以便系统能够在适当时\n机点作判定. 此作业可设定流程中各种情境.
VB013=搜寻浏览:\n同一般维护作业\n\n新增修改:\nA. 复制设定: 将目前的各项设定复制到暂存区\nB. 加载设定: 将暂存区的设定加载到画面上\nC. 关联名称: 此项设定的识别名称. 此字段仅为识别用, 并不用作判断.\nD. 流程定义名称, 流程角色, 作业画面: 指定此设定需处理的流程角色以及\n   画面.\nE. 作业画面模式:\n   1. 流程发起: 表示此设定是填表状态. 此时流程角色可任选\n   2. 流程处理: 表示此设定为签核状态.\n   3. 流程中新增: 表示此设定为签核状态, 但是更改原显示作业画面\n   4. 原稿/通知: 表示此项设定适用于此流程在原稿读取或是通知数据夹\n     读取时使用\n   5. 预设及显示: 此项设定作为当此流程所有状况所需读取的设定并未\n     设定时, 系统即会采用此项设定. 此时流程角色可任选.\nF. 是否为主要显示画面: 当此流程之前的关卡有[流程中新增]模式更改\n   作业画面, 此时便可选择目前此项设定是否为此关卡中作为主要画面\n   显示的设定.\nG. 附件控制: 设定此时附件的使用权限\nH. 检视流程时是否显示流程图: 若勾选, 则会显示流程图以及签核意见;\n   若不勾选, 则仅显示签核意见\nI. 权限项目: 设定此设定适用的权限. 在流程操作中的各项功能皆由设定\n   作业完成, 因此除非特殊使用目的, 建议此字段选择适用全部使用者的\n   权限.\nJ. 凭证打印时是否打印条形码: 当勾选时, 使用者按下打印凭证按钮, 所列\n   印出来的画面右上方会有代表此窗体单号的Code39条形码.\nK. AgentSchema: 处理此作业画面使用的数据对象完整类别名称\nL. 解析: 当上述的操作设定完成后按下解析钮, 系统会将作业画面的字段\n   新增/删除到[画面字段]页签中的清单.\n\n[送单控制]页签: 此项设定仅在模式为[流程发起]时有效.\nA. 窗体单号格式: 选择此流程发起后的单号采用的自动编号格式.\nB. 送单后控制: 若为[原稿模式显示], 画面内容皆会保留, 同时切换至原稿\n   状态. 若为[关闭窗口], 则会将目前操作的窗口关闭, 或是回到清单. 若为\n   [显示流程图], 则会显示流程图以及签核意见. 若为[显示填表画面], 则会\n   开启一个同样作业画面的新窗口以便重新填写另一张窗体.\nC. 主旨格式字符串: 设定系统自动产生的主旨格式. 此格式可设定各项变量, \n   请参考操作画面的[说明]钮窗口内容说明.\nD. 草稿笔数限制: 可设定同一作业画面储存草稿时的数据限制. 若有限制,\n   新的草稿会替换最旧的一笔草稿.\n\n[签核相关]页签: 此页签仅在模式为[流程处理]时生效:\nA. 意见表达: 当选择[标准]时, 则流程是否往下解析会依照[意见表达群组]\n   的设定处理. 若为[意见表达], 则不论[意见表达]中的设定为何, 流程一律\n   往下解析.\nB. 意见表达群组: 此签核关卡时的意见表达状态. 请参考[意见表达设定\n   作业]说明.\nC. 签核后控制: 若为[回收件夹], 则签核完毕后会关闭窗口并回到收件夹.\n   若为[显示流程图], 则会显示流程图以及签核意见. 若为[自动开启收件\n   夹第一笔数据签核], 则会回到收件夹后自动开启第一笔须签核的窗体.\nD. 允许转寄类型: 设定若此时允许转寄, 可以转寄的类型\nE. 参考流程: 若此关卡可以发起参考流程, 设定可以发起的流程定义.\nF. 于参考流程结束后才可签核: 若勾选此项, 系统在使用者按下签核前,\n   会先检查之前关卡所发起的参考流程是否结束. 若有任一流程未结束,\n   则不允许签核.\n\n[显示设定]页签: 此页签可设定窗体信息区块以及签核意见区块的显示\n设定.\n\n[工具列]页签: 此页签可以设定目前设定状态下是否允许该按钮显示, 以\n及设定显示名称.\n\n[按钮画面]页签: 此页签可设定工具列按钮按下时, 所开启的画面URL.\n\n[加签角色]页签: 若此关卡允许加签, 则此页签可以设定使用者选择加签\n人时所指定的关卡角色.\n\n[画面字段]页签: 此页签内容为[解析]功能所产生. 此页签可以设定目前\n关卡状态下各个字段的各项设定.\n\n[待办检视数据夹]设定: 目前此页签功能已不使用.
VB014=此作业各项设定的目的以及搭配使用请参考文件说明.
[ChangeSQLField]
VB010=无
VB011=管理者可透过此作业直接修改数据表内容值
VB012=当管理者需要直接对数据表操作并留下异动纪录时, 可透过此作业作操作.
VB013=请依照画面的步骤做操作.\n步骤一：当选择一数据表后, 系统会自动将该数据表内容呈现在步骤三的\n　　　　Grid中\n步骤二：请选择该数据表要修改的字段\n步骤三：请勾选一笔要修改内容的数据\n步骤四：请先按下左方[提取数据]按钮, 此时会将步骤三所选择的数据, 将\n　　　　步骤二所设定的字段内容显示在TextArea中. 此时管理者可在\n　　　　TextArea中修改该字段内容值. 当修改完毕后, 请按下[确认修改]\n　　　　按钮以便更新数据
VB014=1. 异动纪录无法做Rollback动作\n2. 异动纪录储存在CHANGESQLFIELD数据表中\n3. 此作业仅能针对MS SQL Server 2000以及2005做修改
[DefaultInbox]
VB010=无
VB011=统一所有待处理作业的读取、审核，亦提供群签功能。
VB012=当您想处理工作事项时，请点选系统选单上的「待处理数据匣」，系统便\n会在工作区显示需要您处理的工作事项清单。
VB013=Step1 点选「个人作业区」后，在系统选单中点鼠标左键一下「待处理资\n料匣」，即可呈现数据匣内容，工作区会呈现群签、搜寻与清单画面。\nStep2 搜寻可以依照?工作性质?、?列出此流程?、?主旨包含?、?工作建立\n时间?做搜寻，?工作性质?分为：\n(1)不限定：所有待签核窗体。\n(2)正常指派：目前该由使用者签核的窗体。\n(3)他人重新指派（退回重办）：遭到退回的窗体。\n(4)抽回重办工作：所有使用者取回重办的窗体。\n依需要填入条件后按下『搜寻』钮即可。\nStep3.1 若要群签，只要将需要一起签的窗体勾选起来，在?群签?下拉选\n单选择同意或不同意，填入签核意见后，按下群签即可。\nStep3.2 直接于清单中点选欲处理项目，即可开启待处理作业画面，供登\n入者签核。
VB014=系统管理者可设定待处理数据匣是否有『群签』功能；若该数据匣不允许\n『群签』，则群签的区域会隐藏。
[SMRD]
VB010=无
VB011=整合BI工具时, 透过此作业可设定登入BI时的账号以及密码
VB012=当在[报表各项设定作业]中, Webi整合选项的[权限/账号对应模式]选择[权\n限群组对应], 则需透过此作业设定各个权限群组所对应的BI登入账号以及\n密码.
VB013=1. 查询以及浏览: 相同于一般作业\n2. 新增以及修改:\n  A. 权限群组代号: 直接登打权限群组代码或是开窗选择\n  B. Webi登入账号: 请输入对应BI系统的登入账号\n  C. Webi密码: 若在新增状态时, 此字段必须填写. 若不须密码, 则请勾选\n     后方的[无密码]选项并保持此字段空白. 若在修改状态, 此字段预设皆为\n     空白. 若有填写此字段内容, 表示需修改对应的密码. 若保持空白, 则表\n     示保留原设定密码. 若勾选后方[无密码]选项, 则系统会设定密码为空白.
VB014=1. 此作业所设定的对应账号/密码为对应BI系统的使用者, 而非ECP的使用者.\n2. 当密码设定并储存后, ECP会加密该密码. 此密码无法透过任何操作接口\n   取得.
[SMSB]
VB010=无
VB011=提供管理者管理设定系统使用者对系统各权限项目的使用权限。
VB012=当有新增使用者时，可于此作业设定其使用权限。
VB013=依照一般维护作业操作流程。
VB014=系统预设提供一个群组代号为SYSTEMDEFAULTGROUP的权限群组。此\n群组不需设定任何成员，但可设定权限项目。当任一使用者不归属于任何\n群组时，系统预设会将该成员归属于此群组。此种设定适合当一使用者刚\n加入系统后，系统管理员尚未设定该成员的权限前，使用者仍有基本功能\n可以使用。
[SMWA]
VB010=无
VB011=当开发人员开发完一作业画面后, 透过此作业向系统登录.
VB012=透过此作业可登录作业画面定义, 并同时解析画面字段内容以及维护作业\n模式操作时的基本功能定义.
VB013=搜寻浏览:\n同一般维护作业.\n\n新增修改:\nA. 作业画面代码名称: 设定此作业画面定义的代号以及名称.\nB. 主旨格式: 此字段已不使用.\nC. 作业画面URL: 当开发完成作业画面的程序代码后, 指定该作业画面所处\n   的位置以便解析字段. \nD. 解析: 按下此按钮后, 系统会自动解析该画面的DSCWebControl并将\n   预设设定新增/更新到[画面字段设定]页签.\nE. AgentSchema: 设定处理此作业画面的数据对象完整类别名称.\nF. 权限项目: 设定能够处理此作业画面的权限项目.\nG. 说明: 说明此作业画面用途.\nH. 本作业在无流程设定时是否改用此作业设定: 此选项已不使用.\nI. 送出后模式: 当在不发起流程的维护作业模式时, 选择[关闭画面], 则在\n   储存后会回到清单. 若选择[画面停留], 则会保持输入画面状态.\n\n[工具列设定]页签:\n此页签可以设定在不发起流程的维护作业模式下, 新增/修改/删除画面的\n工具列显示名称以及是否启用. 当各个按钮前方的勾选字段有勾选, 代表\n此按钮可使用, 若修改后方输入字段的内容值, 则按钮会以新值来呈现.\n若勾选[是否使用此设定取代预设显示设定], 则上述设定生效; 反之则无效.\n\n[画面字段设定]页签:\n此页签可设定在新增/修改状态下各字段的控制内容. 清单中的字段必须透\n过[解析]按钮新增设定. 此项设定仅在不发起流程的维护作业模式下生效.
VB014=1. 作业画面URL为相对于web数据夹下开始.\n2. 解析画面时, 若此作业画面先前已有定义字段, 解析后并不会修改原本\n   已有设定, 但会根据情况新增/删除字段定义.\n3. 一般而言, 操作作业画面的权限都会根据流程/角色等定义来执行, 因此\n   除非有特殊需求, 权限项目一栏建议开放全系统使用者使用.
[SMWG]
VB010=无
VB011=设定系统原稿数据夹的清单显示字段
VB012=透过此作业可以改变系统预设原稿字段的显示, 以及定义延伸的原稿\n清单字段.
VB013=[显示设定]页签:\n此页签可以设定系统预设的原稿字段, 何者可以出现在原稿数据夹中.\n\n[延伸字段设定]页签:\n此页签可以定义最多20个延伸字段.\nA. 字段名称: 定义此延伸字段内容值纪录在何数据表字段\nB. 变量名称: 定义当各窗体(作业画面)发起流程时, 指定写入此字段的变量\n   名称.\nC. 显示名称: 此延伸字段显示在原稿数据夹的字段标题.
VB014=设定延伸字段后, 开发人员必须在程序代码当中透过指定[变量名称]的方式\n   将实际值写入到此字段中.
[SinyiInBox]
VB010=
VB011=
VB012=
VB013=
VB014=
[SMXB]
VB010=无
VB011=设定稽核纪录中各不同作业所发出的纪录类型定义, 以及相对应处理稽核\n纪录的动作.
VB012=透过此作业可以定义系统各个不同的模块, 并指定属于各模块的稽核纪录\n发生时, 系统所应采取的通知/处理动作. 另外在模块中可针对不同的程序\n别定义属于该程序别的稽核纪录发生时的不同通知/处理动作.
VB013=搜寻浏览:\n同一般维护作业.\n\n新增修改:\nA. 应用程序代号: 设定此模块所属的应用程序. 系统应用程序别请透过\n   [应用程序设定作业]进行设定.\nB. 模块代号: 设定此模块的代号\nC. 模块名称: 设定此模块的名称\nD. 通知人员: 当属于此模块的例外发生时, 系统须通知的对象. 可按下后\n   方的[选择]钮进行多人的选择.\nE. 是否Email通知: 当勾选此项, 系统会将例外信息, 以Email方式通知[通知\n   人员].\nF. 是否警示: 当勾选此项, 若[通知人员]当中有人登入此系统, 系统会在主\n   画面右下角以MSN方式通知该人员, 此笔通知亦会出现在该通知人员的\n   个人讯息区.\nG. 是否纪录Log: 当勾选此项, 系统会将例外纪录到数据表中, 管理者可透\n   过[稽核纪录检视作业]以及[稽核记录统计]做搜寻/统计此例外.\n\n清单:\n此清单可设定指定的程序别以及错误层级的例外发生时, 系统所需采用的\n通知/处理方式.\nA. 程序代号: 设定符合此特殊处理的所属程序代号.\nB. 错误层级: 符合此特殊处理的例外所对应的错误层级.\nC. 是否Email通知, 是否警示, 是否纪录Log, 通知人员: 相同于上述设定
VB014=此作业所设定的处理动作为[例外设定], 当某作业抛出例外时, 系统会先检\n查是否该作业的程序别有在此作业中定义处理方式. 若无, 系统才会检查\n该作业所属的模块别是否有定义. 若皆无, 则此例外不会处理.
[SystemDesigner]
VB010=无
VB011=直接进入流程引擎的系统设定画面
VB012=透过此连结可直接进入流程引擎的系统管理工具画面
VB013=请参阅流程引擎相关说明文件.
VB014=无
[SMXE]
VB010=无
VB011=查询各时间区间所发生的纪录统计
VB012=透过此作业可统计不同时间区间/类型等方式所统计出来的稽核记录笔数
VB013=分析时间区块:\n请输入查询期间的起迄. 此两字段必填\n\n分析方式区块:\n可采用以下三种区分区块方式:\n1. 时间区隔: 可选择每月, 每日, 每小时, 每分钟做统计单位\n2. 性质分类: 可选择应用程序别, 模块别, 程序别, 使用者, 错误层级做为统\n　　　　　　计单位\n3. SQL语句: 若管理者知道此数据表的结构, 并须根据与上述方式不同的\n　　　　　　分类方法做统计, 则可选择此方式. 此方式的SQL语法下达\n　　　　　　后, 数据集必需包含FLD以及CCS两个字段, 分别为各区间\n　　　　　　(FLD)以及统计值(CCS).\n\n显示方式:\n可选择水平长条图, 垂直长条图, 或是圆饼图
VB014=无
[SMWC]
VB010=无
VB011=此作业可将流程引擎所定义的角色(活动)同步到系统中.
VB012=当管理员新增/修改/删除流程定义时, 必需透过此作业将流程数据同步到\n系统中, 已进行相关作业设定.
VB013=搜寻浏览:\nA. 同一般维护作业\nB. 同步更新时是否移除系统数据: 当勾选此项目, 同步更新时若该角色不\n   存在于流程引擎中, 但却存在于系统中, 则会一并将该流程由系统中删除.\nC. 同步更新: 按下此钮可将角色定义由流程引擎同步到系统中.\n\n新增修改:\nA. 角色名称: 流程引擎定义的活动名称. 此角色为从流程引擎同步而来, \n   此字段不可修改.\nB. 系统/流程引擎: 若为[流程引擎], 则表示此角色为从流程引擎同步而来.\n   若为[系统自订], 则表示是由管理者自行定义.
VB014=1. 当同步时, 勾选移除系统数据所判定的角色仅为[流程引擎]者. 若该角色\n   为[系统自订], 则不会受此勾选项目影响.\n2. 此作业能新增删除修改的角色定义仅能为[系统自订]者.
[SMVS]
VB010=无
VB011=当系统需下载任何在Client安装的组件/程序时, 可透过此作业设定下载\n项目清单.
VB012=不同的版本浏览器对于安装画面组件(或是下载需在Client安装的程序)时, \n会因为Client端设定环境的不同导致安装程序中出现警示讯息导致无法顺\n利完成安装步骤. 或是Client组件开发考虑, 需提供一独立页面以供使用者\n直接点选下载/安装. 此时可透过此作业来设定下载项目清单.
VB013=1. 查询以及浏览: 相同于一般作业\n2. 新增以及修改:\n  A. 下载标题: 此项目在下载页面时所呈现的标题\n  B. HTML内容: 下载页面为一HTML格式内容, 请根据此需下载组件的需要\n     定义呈现在下载页面的对应HTML码.\n  C. 权限项目: 决定何权限使用者可下载此组件\n  D. 是否上线: 当勾选此项目, 则此笔下载组件会根据使用者权限作显示.\n     若不勾选, 则此项目永远不会出现在下载清单中
VB014=1. ECP安装后, 此作业会提供系统预设需下载的组件清单\n2. 此作业必须配合[系统设定作业], 勾选[允许下载组件联结]项目使用. 若\n   此项目勾选, 则系统会在登入后主画面工具列右上角出现下载钮.
[SMXC]
VB010=无
VB011=查询稽核纪录详细内容
VB012=透过此作业可以查询系统稽核纪录. 当在开发阶段, 开发人员亦可将重要\n历程, Log等方式记录到此作业中, 方便追踪程序代码, 或是作为效能分析.
VB013=搜寻浏览:\n同一般维护作业.\n\n检视:\nA. 应用程序代号名称: 此笔纪录发生时所属的应用程序别\nB. 模块代号名称: 此笔纪录发生时所属的模块别\nC. 程序代号名称: 此笔纪录发生时所属的程序别\nD. 使用者代号名称: 此笔纪录发生时登入的使用者\nE. 警示层级: 此笔纪录发生时的错误层级\nF. 记录时间: 此笔纪录发生时的时间\nG. 客户端位置: 此笔纪录发生时, 客户端操作的IP\nH. 浏览器版本: 此笔纪录发生时, 客户端操作的浏览器送出的版本信息\nI. 警示讯息: 错误讯息\nJ. 追踪内容: 此笔纪录发生时程序代码位置的StackTrace信息
VB014=无
[SMSD]
VB010=无
VB011=由系统中将权限设定数据汇出至固定格式的 Excel 档案或 xml 档案。
VB012=若有异质系统需取得相关的权限设定数据，可使用「权限设定汇出作业」\n将ECP系统中的权限数据汇出。
VB013=Step1 点选「系统作业区」后，在系统选单中点鼠标左键一下「权限设定\n汇出作业」，即于工作区呈现汇出画面。\nStep2 依需要填入字段值后按下『汇出』钮即可。\n\n(1)汇出项目：群组权限设定、权限项目设定。\n(2)档案格式：标准 xml 、excel xml 电子表格。
VB014=所汇出的档案格式为Excel的XML格式，可使用Microsoft Excel开启。\n若修改后的内容需要汇入至系统，需将该Excel档的格式另存为标准Excel\n格式。
[InfoBox]
VB010=无
VB011=统一所有流程中通知关卡的案件数据读取。
VB012=当您想浏览自己所接收到的系统通知时，请点选系统选单上的「通知数据\n匣」，系统便会在工作区显示您所接收的系统通知清单。
VB013=Step1 点选「个人作业区」后，在系统选单中点鼠标左键一下「通知数据\n匣」，即可呈现通知数据匣内容，工作区会呈现搜寻条件与清单。\nStep2 搜寻可以依照?工作性质?、?列出此流程?、?主旨包含?、?工作建立\n时间?做搜寻，?工作性质?分为：\n(1)不限定：所有通知窗体。\n(2)系统自动通知：此通知是由系统发出的。\n(3)私人转寄：这个窗体转送给使用者时，不会显示在传送历程中。\n(4)一般转寄，显示在流程追踪：这个窗体转送给使用者时，会显示在传送\n历程中。\n(5)被代理通知：显示被代理窗体的通知。\n(6)流程被撤销或工作被回收：送出窗体被撤销或回收的通知。\n依需要填入条件后按下『搜寻』钮即可。\nStep3 直接于清单中点选欲检视项目，即可开启检视作业画面。
VB014=通知窗体只能检视，不能修改与签核。
[SMVF]
VB010=无
VB011=设定系统行事历显示时的项目类别
VB012=透过此作业可设定系统行事历中的项目类别, 以及显示时的颜色.
VB013=搜寻浏览:\n同一般维护作业.\n\n新增修改:\nA. 类型代号名称: 设定此行事历类型的代号以及名称.\nB. 是否使用: 当为[否]时, 使用者在新增行事历项目时的类别选项中不会\n   出现此设定.\nC. 颜色RGB: 利用RGB的设定方式指定此类别的颜色.
VB014=无
[SMXA]
VB010=无
VB011=设定系统稽核模块各个应用程序别
VB012=当须透过稽核模块做例外的纪录时, 透过此作业可以设定例外所属的应用\n程序.
VB013=搜寻浏览:\n同一般维护作业.\n\n新增修改:\nA. 应用程序代号: 设定此应用程序别的代号\nB. 应用程序名称: 设定此应用程序别的名称
VB014=应用程序别所设定的内容与系统选单等皆无关, 完全由开发人员在开发各\n作业画面, 维护程序, 批次等程序代码时指定该次例外应该对应的应用程序别.
[CmcApp]
VB010=无
VB011=BI工具管理接口
VB012=当系统整合BI应用工具时, 可透过此界面做BI相关管理设定
VB013=请参考相关BI工具使用说明文件
VB014=此作业非ECP系统提供, 需整合BI系统使用.
[STD002]
VB010=
VB011=
VB012=
VB013=
VB014=
[OrganizationUnitLevelMaintain]
VB010=无
VB011=检视 Flow Engine(EasyFlow GP) 系统中所设定的组织核决层级数据，仅\n提供检视，无新增、删除、修改功能。
VB012=若要查询流程设计中组织核决层级数据，可透过「组织核决层级检视作\n业」查询。
VB013=依照一般维护作业操作流程。
VB014=若要新增、删除、修改组织核决层级数据，可至 Flow Engine(EasyFlow \nGP) 系统中做调整。\n\n※组织核决层级定义，组织单元因核决权限的需要会有层级的分别，如课\n级部门、处级部门等层级。
[SMRA]
VB010=无
VB011=透过此作业可定义系统可使用的DOC以及XLS格式的凭证.
VB012=当开发者撰写好符合规则的格式文件后, 透过此作业向系统作登录动作. \n在开发阶段透过系统组件, 将实质报表(凭证)内容以XML的结构传入系统\n中, 系统会根据此作业所登录的格式来显示XML的数据内容. 因此若报表\n或凭证显示格式异动, 仅需透过此作业来修改格式即可, 不需在程序代码中\n做相关的异动.
VB013=1. 查询以及浏览: 相同于一般作业\n2. 新增以及修改:\n  A. 报表格式定义代号: 请填写唯一的识别代号. 此代号新增后即不可修改\n  B. 报表格式定义名称: 请填写一容易识别的名称\n  C. 报表格式档案: 请上传一符合规则撰写的DOC或是XLS文件\n  D. 报表格式定义类型: 系统会根据所上传档案的扩展名自动填入此字段\n  E. 定义XML(解析按钮): 当上传档案后, 请按下[解析]按钮, 确认系统能够\n     辨识合法的报表格式档案. 若定义档案合法, 则会在右方TextArea显示\n     开发人员需传入的资料XML格式.\n  F. 是否开放其它人使用: 当勾选时, 其它使用者亦可修改此定义档内容. \n     若不勾选, 则仅有建立者能够修改此定义档内容.
VB014=此定义作业建议作为凭证使用, 若需报表呈现, 则建议使用Reporting\nService或是BI工具.
[FormDesigner]
VB010=无
VB011=直接登入流程引擎窗体设计师画面
VB012=透过此连结可直接登入窗体设计师
VB013=请参阅流程引擎相关说明文件.
VB014=流程引擎的窗体设计师为设定窗体参数所使用, 而非系统画面设计.
[ProjectMaintain]
VB010=
VB011=
VB012=
VB013=
VB014=
[STDDOC]
VB010=
VB011=
VB012=
VB013=
VB014=
[SMWM]
VB010=无
VB011=此作业可针对指定的流程做AfterApprove的执行以及将特定关卡转派给\n其它使用者.
VB012=当流程发生结案后, 后续动作没有正确动作, 或是签核关卡人员发生例外\n状况(例如组织异动等), 管理员透过此作业可以直接进行处理.
VB013=搜寻画面:\nA. 流程状态: 可选择搜寻流程的状态条件\nB. 流程代号: 可指定要搜寻的流程\nC. 起迄时间: 可指定要搜寻的流程发起区间\n\n处理画面:\n流程改派区块:\nA. 要改派的关卡: 若该流程同时有两个以上可以处理的关卡, 可选择要设\n   定的关卡.\nB. 要改派的对象: 若该关卡有两个以上的处理者, 可选择要改派的处理者.\nC. 改派方式: 当选择代理转派, 则转派后续的关卡仍依照转派前的组织程\n   序进行; 若选择工作转派, 则依照转派后的处理者的组织程序进行.\nD. 新处理者: 请选择转派后的处理人员\nE. 改派意见: 请填写转派原因说明\nF. 改派: 按下后进行转派动作.\n\n重新执行AfterApprove区块:\nA. 执行结果: 可选择要重新执行状态的原流程执行结果. \nB. 重新执行: 按下后进行重新执行动作.
VB014=1. 当点选的流程为尚未完成, 则仅有流程改派区块出现; 若为已结案, 则出\n   现重新执行AfterApprove区块.\n2. 当流程已结案, 重新执行AfterApprove区块时可选择与原流程不同的处理\n   结果来重新执行. 另外, 此功能并不会影响/改变原流程, 仅针对流程结束\n   后的动作进行处理.
[FunctionDefinitionMaintain]
VB010=无
VB011=检视 Flow Engine(EasyFlow GP) 系统中所设定的职务定义数据，仅提供检视，无新增、删除、修改功能。
VB012=若要查询流程设计中职务定义数据，可透过「职务定义检视作业」查询。
VB013=依照一般维护作业操作流程。
VB014=若要新增、删除、修改职务定义数据，可至 Flow Engine(EasyFlow GP)\n系统中做调整。\n\n※职务定义，一个组织可以定义多个职务，如课长、襄理、经理、总经\n理．．．等。
[SMWB]
VB010=无
VB011=此作业可将流程引擎所定义的流程同步到系统中.
VB012=当管理员新增/修改/删除流程定义时, 必需透过此作业将流程数据同步到\n系统中, 已进行相关作业设定.
VB013=搜寻浏览:\nA. 同一般维护作业\nB. 同步更新时是否移除系统数据: 当勾选此项目, 同步更新时若该流程不\n   存在于流程引擎中, 但却存在于系统中, 则会一并将该流程由系统中删除.\nC. 同步更新: 按下此钮可将流程定义由流程引擎同步到系统中.\n\n新增修改:\nA. 流程OID: 流程引擎中代表此流程定义的对象代号\nB. 流程代号名称: 流程引擎中代表此流程的代号以及名称\nC. 是否显示窗体信息: 当勾选时, 预设此流程显示窗体画面时皆会显示\n   窗体信息. 此项设定可在[流程作业画面关联作业]做特殊的设定.\nD. 是否显示签核意见: 当勾选时, 预设此流程显示窗体画面时下方皆会\n   显示签核意见列表. 此项设定可在[流程作业画面关联作业]做特殊的设定.\n\n流程参数区块:\n此区块显示在流程引擎定义中所设定的各项窗体参数以及流程变量. 此\n区块清单中的项目仅只读不可修改.
VB014=1. 当管理者改变了流程定义中的流程变量以及窗体参数, 需透过此作业同\n   步后更新[流程参数]区块的内容定义, 否则在操作流程中会发生例外.\n2. 当同步更新后, 可透过检视流程参数区块内容是否正确来确认更新状况.
[SMVA]
VB010=无
VB011=此作业可设定系统预设选单.
VB012=当新增/删除程序项目前, 或是要改变系统选单结构, 透过此作业可改变\n选单的显示.
VB013=此作业操作画面下方可分为左右两个主要区块:\nA. 左方区块:\n  1. 呈现目前系统选单架构. 第一层对应系统选单的Outlook Button, 而第\n     二层以后会以树状架构呈现在选单中.\n  2. 当我们在[系统选单]节点上按下鼠标右键, 会出现选单[新增模块]. 此时\n     可新增第一层选单(Outlook Button)\n  3. 当我们在某模块节点上按下鼠标右键, 会出现选单项目. 其中[新增模块]\n     可在此节点下新增子模块节点; [修改模块]则可以修改目前此模块的显\n     示名称以及图形; [往上][往下]可调整此模块在同层模块中的选单显示顺\n     序; [切换预设开启]则可以指定此模块在系统选单开启时, 是否自动将树\n     状架构展开到此模块. 若此项目开启, 则此模块前方会显示不同的图标.\n  4. 当我们要删除某一模块(包含其下的子模块以及程序项目), 仅需将该模\n     组拖放到上方的垃圾桶符号上即可. 当删除程序项目, 并不会将该程序\n     由系统中删除掉, 仅是移除在选单上的显示.\nB. 右方区块:\n  右方区块为目前透过[程序代码维护作业]所登录的系统程序项目清单. 可\n  直接拖放各程序项目前端的图标到左方区块的模块下, 即可在该模块新增\n  此程序项目.\nC. 搜寻可使用作业: 可填写要搜寻的程序作业名称, 按下[搜寻]钮后, 搜寻\n   结果会出现在右方区块中. \nD. 显示全部: 会将系统所有登录的程序项目显示在右方的区块中.\nE. 储存设定: 当设定完选单结构后, 按下此按钮以便储存改变.\nF. 汇出设定: 此作业可以将目前的选单结构汇出成XML格式文字文件.
VB014=1. 个人面板设定中的选单设定画面操作相同与作业.\n2. 此作业仅影响选单架构, 不影响已登录的作业.
[SMSE]
VB010=无
VB011=提供使用者查询系统中所有作业或某作业的使用权限。
VB012=当使用者设定于多个群组中时，可透过「使用者权限查询」查询该名使用\n者的所有使用权限。系统会依各群组的权限做有权限的联集后，显示最后\n的权限。
VB013=Step1 点选「系统作业区」后，在系统选单中点鼠标左键一下「使用者权\n限查询」，即工作区会呈现查询与清单画面。\nStep2 查询可以依照?请选择使用者?、?请选择作业?、「仅列出有权限的\n程序项目」做搜寻，依需要填入条件后按下『开始查询』钮即可于「隶属\n群组、使用者权限」两页签看到查询结果。
VB014=系统预设会列出系统设定的所有权限项目，或是有选择的权限作业。当勾\n选『仅列出有权限的程序项目时』，如该使用者对所下达条件所搜寻出的\n权限项目都无权限时，该权限项目不会列在『使用者权限』页签当中。
[SMTC]
VB010=无
VB011=供使用者检视批次执行记录，无新增、删除、修改功能。
VB012=当管理者想得知系统批次执行的进度及状况时，可透过「批次执行记录检\n视作业」查询。
VB013=依照一般维护作业操作流程。
VB014=此作业只能查询到由「批次代码维护作业」所设定排程执行的批次执行结\n果及进度。批次执行进度需由各批次程序回写数据，才可于此作业中查询\n到。
[TitleDefinitionMaintain]
VB010=无
VB011=检视 Flow Engine(EasyFlow GP) 系统中所设定的职称定义数据，仅提供\n检视，无新增、删除、修改功能。
VB012=若要查询流程设计中职称定义数据，可透过「职称定义检视作业」查询。
VB013=依照一般维护作业操作流程。
VB014=若要新增、删除、修改职称定义数据，可至 Flow Engine(EasyFlow GP)\n系统中做调整。\n\n※职称定义，一个组织可以定义多个职称，如课长、襄理、经理、总经\n理．．．等。
[SMVI]
VB010=无
VB011=设定系统各种自动编号的格式.
VB012=当系统使用到各式的编号时, 透过此作业可定义不同的编码格式. 系统表\n单在发起流程时所设定取得的单号格式亦是透过此作业作定义.
VB013=搜寻浏览:\n同一般维护作业.\n\n新增修改:\nA. 格式代码名称: 此编号格式的代号以及名称\nB. 说明: 说明此编号预计的用途\n\n清单区块:\nA. 重新整理顺序: 按下此钮可将各节段的定义顺序依照[顺序]字段作排序\nB. 顺序: 可设定此节段的位置. \nC. 类型: 分为以下数种:\n     1. 字轨: 为固定字符串\n     2. 公元年: 固定为四码公元年\n     3. 民国年: 固定为三码民国年\n     4. 字符串替换: 可在下方的文字输入区输入要替换的变量以及固定字符串. \n       需被替换的变数格式为#变量名称#\n     5. 月: 固定为两码月份\n     6. 日: 固定为两码日期\n     7. 流水号: 根据群组设定, 取得该群组下所有编号后加一. 流水号长度\n       由[字轨长度]设定.\n     8. SQL: 可下达一组SQL指令, 系统会根据所取出的第一笔数据的第一\n       字段值作为此编码节段真实值. 在SQL的where条件可定义变量:\n       #变量名称#\nD. 是否为群组: 若该节段勾选此项目时, 系统根据此编号格式在取得\n     编号时, 会先根据各节段定义(除流水号)以外, 取得实际值后, 再将勾选\n     此项目的内容组成一字符串, 透过此字符串去比对以产生的编号, 取得最\n     新一笔一笔的资料后, 判断流水号的值.\nE. 字轨长度: 当使用流水号的节段, 可输入流水号的长度.
VB014=1. 假设四个节段的顺序分别为1,2,3,4, 若要将节段4调整到1以及2之间, 可\n   修改节段4的顺序为1.5, 修改后按下重新整理顺序按钮即可.\n2. 同一编码格式不可拥有两组以上的流水号节段.\n3. 若有流水号节段, 则必须定义至少一群组节段; 群组节段必须位于各编\n   号节段的前几组且连续. 若不依照此规则定义编号格式, 则取出的编号\n   系统不保证能有效.
[SMVH]
VB010=无
VB011=此作业可将系统参数集中至此管理, 并可根据不同需求新增参数.
VB012=当系统开发时需使用到参数化定义, 可将参数设定至此作业中, 开发人员\n可透过特定类别取得参数内容值.
VB013=搜寻浏览:\n同一般维护作业.\n\n新增修改:\nA. 参数代号: 设定此参数的代号\nB. 参数名称: 此参数的显示名称\nC. 参数内容值: 设定此参数的内容.\nD. 是否加密: 当勾选此项目并储存, 则[参数内容值]的内容将会被加密后\n   储存.\nE. 说明: 此参数用途说明.
VB014=1. 当勾选加密后, 参数内容值在修改模式下所显示的并非原始值, 而是\n   加密后的值, 以避免非权限人员透过此作业查询到相关参数值.\n2. 若要修改已加密的参数内容, 仅需直接在参数内容值字段中输入原始\n   值即可.\n3. 若某一参数已加密, 取消勾选加密项目后储存, 并不会将加密内容还原.\n4. 开发人员可透过WebServerProject.SysParam类别取得参数内容.
[Signed]
VB010=
VB011=
VB012=
VB013=
VB014=
[UsersMaintain]
VB010=无
VB011=检视 Flow Engine(EasyFlow GP) 系统中所设定的使用者数据，仅提供检\n视，无新增、删除、修改功能。
VB012=若要查询流程设计中某群组的成员，可透过「使用者数据检视作业」查询。
VB013=依照一般维护作业操作流程。
VB014=若要新增、删除、修改使用者数据，可至 Flow Engine(EasyFlow GP) 系\n统中做调整。
[SMVM]
VB010=无
VB011=事先定义一些常用的使用者，方便在转派、转寄…时使用，以加快搜寻选\n取转派、转寄对象的速度。
VB012=使用者在转派、发起参考流程、转寄时，会有常用的对象，例如：相同工\n作性质的同事、同部门的同事…之类的；这时就可以使用「常用使用者设\n定作业」来设定这些使用者。
VB013=依照一般维护作业操作流程。
VB014=此作业所设定的常用使用者为个人所使用。
[SMWH]
VB010=无
VB011=可设定流程签核时, 签核者可以选择的签核结果.
VB012=透过此作业可以预设签核时的结果, 例如[准, 不准], 或是[同意, 不同意]等\n状态, 并可以设定各个签核结果是触发流程往下解析进行, 或是终止流程\n进行.
VB013=搜寻浏览:\n同一般维护作业.\n\n新增修改:\nA. 意见群组代码: 设定此组签核结果设定的代码\nB. 意见群组名称: 设定此组签核结果设定的名称\nC. 说明: 描述此组设定的用途\n\n清单:\nA. 意见值: 使用此组设定的签核关卡, 签核者选择此笔设定时, 系统所记录\n   的签核结果状态值.\nB. 意见内容: 使用此组设定的签核关卡, 签核者在画面上所看到此笔设定\n   的名称.\nC. 流程处理: 若此笔设定为[完成], 代表使用此组设定的签核关卡, 签核者\n   选择此状态后, 流程会继续往下解析进行. 若为[终止], 则签核者选择此\n   笔状态后, 流程会终止.
VB014=1. 影响流程进行的设定是根据[流程处理]做动作, 而非[意见值].\n2. 此群组设定可以提供不止两种意见状态.
[SMVR]
VB010=无
VB011=设定系统各种出差勤班别类型
VB012=透过此作业可修改特定班别的上班时段, 或是批次设定整年度上班时段.
VB013=搜寻浏览:\n同一般维护作业.\n\n新增修改:\n[基本设定]页签:\nA. 班别代号名称: 设定此班别的代号以及名称\nB. 说明: 此班别的用途\n\n行事历清单:\n此班别各年度的上班时间区段.\nA. 上班日期: 需上班日\nB. 时数: 该上班日上班时数\nC. 上/下班时间: 此上班日上下班时间\nD. 午休时间: 此上班日中间休息起迄时间\n\n[批次设定]页签:\n透过此页签可以根据各项不同设定产生[基本设定]页签中的行事历清单, \n或是整批删除此班别特定年度的纪录.
VB014=无
[SMSA]
VB010=无
VB011=提供管理者管理设定权限项目，包含新增、修改、删除功能。
VB012=所设定之权限项目为「权限群组设定作业、程序代码维护作业、作业画面\n设定作业、流程作业画面关联作业……」等作业中的字段[权限项目]之选\n项。
VB013=依照一般维护作业操作流程。
VB014=无
[SMWQ]
VB010=无
VB011=提供使用者发起流程或签核流程后，该流程目前的状况，如：目前进行到\n哪一个活动、由谁在处理，或流程是否结案等信息。
VB012=当您想追踪流程时，请点选系统选单上的「相关窗体查询」，系统即会在\n工作区显示您可以追踪的流程清单。
VB013=Step1 点选「个人作业区」后，在系统选单中点鼠标左键一下「相关窗体\n查询」，即可呈现流程清单内容，工作区会呈现搜寻与清单画面。\nStep2 搜寻可以依照?主旨包含?、?工作建立时间?做搜寻，依需要填入条\n件后按下『搜寻』钮即可。\nStep3 直接于清单中点选欲检视项目，即可开启检视作业画面。
VB014=您可以追踪的流程只包括您发起的流程及您有参与的流程。
[SMSC]
VB010=无
VB011=由固定格式的 Excel 档案将权限设定数据汇入系统中。
VB012=若权限设定数据量过多，可透过「权限设定汇入作业」将数据批次汇入。
VB013=Step1 点选「系统作业区」后，在系统选单中点鼠标左键一下「权限设定\n汇入作业」，即于工作区呈现汇入画面。\nStep2 依需要填入字段值后按下『汇入』钮即可。\n\n(1)汇入异动档：系统会根据Excel内容设定做数据异动。\n(2)汇入完整档案：系统会将所指定的数据库设定全部删除后，再将Excel\n档内容汇入。
VB014=所汇入的Excel档的格式为标准Excel格式。其余Excel兼容的XML格式皆不\n适用。\n权限项目请由权限项目维护作业设定，无法透过此汇入作业设定。\n当汇入的档案内容有误，此次的汇入动作会全部还原。
[OrgDesigner]
VB010=无
VB011=开启流程引擎组织设计师画面
VB012=透过此连结可直接由系统进入组织设计师
VB013=请参阅流程引擎相关说明文件.
VB014=无
[SMVDU]
VB010=无
VB011=仅供使用者检视未读取之系统讯息内容，无新增、删除、修改功能。
VB012=当管理者对所有使用者发布系统讯息后，使用者可透过此作业检视讯息内\n容，「系统讯息未读列表」帮助使用者不会错过重要的系统讯息。
VB013=依照一般维护作业操作流程。
VB014=已读取之系统讯息，无法由此作业检视。
[SMVP]
VB010=无
VB011=定义系统基本功能设定.
VB012=透过此作业可设定一般性的系统操作以及设定.
VB013=A. 储存: 修改各项设定后按下此钮将设定储存\nB. 允许多语系: 勾选后, 登入画面会出现语系选择.\nC. 允许下载组件联结: 勾选后, 主画面右上方会出现下载清单钮. 此设定\n   需配合[组件下载清单设定]作业使用.\nD. 启用系统密码管理: 勾选后, 系统会采用[系统密码原则管理]作业定义\n   的规范使用.\nE. 系统/个人选单视为一般窗口: 当勾选后, 系统以及个人选单可如同一般\n   窗口可拖曳最小化等. 若不勾选, 则选单固定在左方区块.\nF. 是否允许设定个人化选单: 若勾选, 则主画面上方工具列允许个人设定\n   个人选单.\nG. 是否允许自定面板: 若勾选, 则主画面上方工具列允许个人将目前版型\n   储存, 并且在登入后会依照个人面板设定显示预设版型.\nH. 是否允许使用者自订新窗口开启功能: 若勾选, 使用者可以设定新窗口\n   开启时的各项设定.\nI. 是否显示功能列: 若勾选, 则登入后在标题区块以及面板区块中会出现\n   工具列.\nJ. 页面保护: 设定系统所有画面的各项安全保护措施.\nK. 是否预设显示标题: 若勾选, 则登入后主画面会显示标题区.\nL. 是否允许切换标题: 若勾选, 则使用者可在工具列上切换标题的显示.\nM. 最大资料笔数: 目前不使用.\nN. 启用侦错记录文件: 当勾选时, 系统在与流程引擎以及其它地方会预先\n   撰写除写入稽核纪录外的Log点. 此时会将纪录写入到logFolder下的档案.\n   建议在开发阶段或是测试阶段开启此项目, 系统正式上线后取消, 以避免\n   档案处理效能问题.\nO. 打印左边界: 当在打印作业画面时, 预设在打印纸上保留的左方空间(cm)\nP. 打印页首/页尾: 当在打印作业画面时, 可设定每页的页首页尾内容. 可\n   设定的内容变量请参考操作画面的[页首页尾格式]区块.
VB014=无
[SMWI]
VB010=无
VB011=系统可定义多个不同的[收件夹]. 此作业可以针对不同数据夹做搜寻范围\n限定.
VB012=若系统需针对特定使用者群组做[待处理作业]清单的设定时, 透过此作业\n可以定义不同的待处理数据夹定义.
VB013=搜寻浏览:\n同一般维护作业.\n\n新增修改:\nA. 资料夹代码: 此收件/通知夹的定义代号\nB. 数据夹名称: 此收件/通知夹的定义名称\nC. 类型: 此笔定义为收件夹或是通知数据夹\nD. 是否允许群签: 当类型为收件夹时, 可选择是否群组签核.\nE. 意见表达群组: 当允许群组签核时, 签核意见状态所使用的意见表达定\n   义.\n\n[流程选择]页签:\n此页签定义此数据夹负责读取的流程类型. 可为排外设定或是列举设定.\nA. 所有流程, 除以下之外: 当选择此设定, 则系统视此数据夹收取除了下面\n   清单所选择的流程之外所有流程.\nB. 仅以下流程: 当选择此设定, 则系统仅会收取下面清单所指定的流程\nC. 选择流程: 选择一笔要加入到下方清单的流程.\n\n[角色选择]页签:\n此页签定义此数据夹负责读取的关卡. 可为排外设定或是列举设定.\nA. 所有角色, 除以下之外: 当选择此设定, 则系统视此数据夹收取除了下面\n   清单所选择的角色之外所有角色.\nB. 仅以下角色: 当选择此设定, 则系统仅会收取下面清单所指定的角色\nC. 选择角色: 选择一笔要加入到下方清单的角色.\n\n[字段显示]页签:\n此页签可以从系统预设的收件/通知资料夹字段中, 选择需要显示在清单中\n的字段.
VB014=1. 透过此作业定义完成后的[收件夹]并不会自动出现在系统选单中, 请先\n   利用[程序代码维护作业]进行设定后, 再透过[系统选单设定作业]加入到\n   系统选单中.\n2. 请参见[程序代码维护作业]的新增/修改画面上的说明, 将此定义好的待\n   处理数据夹加入到系统程序清单中.\n3. 此作业同时可定义[收件夹]以及[通知夹].\n4. 当允许群签时, 请注意此数据夹定义收取的待处理项目状态是否能够同\n   进行此作业.
[Sample40]
VB010=
VB011=
VB012=
VB013=
VB014=
[DBAccess]
VB010=无
VB011=透过此作业可直接处理系统数据表.
VB012=当管理者需直接处理资料表字段内容值时, 可利用此作业来作内容查询, \n以及直接下达SQL指令.
VB013=A. 资料表下拉选单: 可在此下拉选单中选择要检视的数据表名称\nB. 显示数据: 当按下此按钮时, 会在最下方的Grid中显示所选择的数据表\n   内容\nC. 执行: 管理者可在中间的TextArea中输入要下达的SQL命令. 按下此按\n   钮后执行.
VB014=1. 透过此作业所更改的数据内容并不会做Log纪录\n2. 此作业所处理的数据库仅限定为MS SQL Server 2000以及2005
[SMRC]
VB010=无
VB011=不同的报表系统整合时, 可视情况透过此作业作相关参数设定.
VB012=目前此作业仅提供BI工具整合时设定.
VB013=Webi报表整合设定:\nA. 权限/账号对应模式:\n   此功能有两个选项. 若选择[权限群组对应], 则当使用者点选相关BI报表\n   连结时, 系统会根据使用者登入后所属的[权限群组], 透过[权限群组账号\n   对应作业]取得所对应的BI登入账号自动对BI系统做登入. 若选择[账号对\n   应], 则会以目前登入者的账号对BI系统做登入.\nB. Trusted Authentication: 当勾选此项目时, 根据[权限/账号对应模式]所\n   述取得登入账号后, 直接对BI系统做登入而不需密码验证. 若不勾选, 则\n   会根据目前登入者的密码或是[权限群组账号对应作业]所设定的密码作\n   密码验证.\nC. OpenDocument网址: 此网址提供ECP设定直接连结BI报表的URL前段\n   部份.\nD. 整合验证网址: ECP整合BI工具时, 亦会整合SSO登入, 因此在BI工具\n   安装主机上需建立一负责验证的WebService. 此WebService 地址需透\n   过此参数做设定.\nE. InfoView网址: 设定直接开启BI报表接口的网址. 当设定此网址后, ECP\n   使用者可直接点选BI InfoView选单项目直接开启画面\nF. CMC网址: 设定直接开启BI报表管理接口的网址. 当设定此网址后, ECP\n   使用者可直接点选BI CMC选单项目直接开启管理画面
VB014=1. 当勾选Trusted Authentication时, BI工具段必须做Trusted相关设定\n2. 当系统根据设定做BI系统登入时, 若登入失败, 会显示BI段的登入验证\n   窗口.\n3. 当修改后, 请记得按下上面[储存]按钮以便将所修改数据储存.
[SMVB]
VB010=无
VB011=设定系统可使用的各项作业
VB012=当新增一只窗体, 作业, 报表, 或外部连结时, 可使用此作业新增一项目.\n此作业所设定的程序, 可使用系统选单设定作业设定到选单去
VB013=依照一般维护作业操作流程
VB014=无
[SMVT]
VB010=无
VB011=当使用者在Client端有安装[鼎新计算机ECP客户端通知]的独立程序时,\n透过此作业设定何使用者有权限使用此程序.
VB012=当系统开放并提供特定使用者安装[鼎新计算机ECP客户端通知]时, 为了\n避免其它使用者直接安装此独立程序后读取数据造成系统效能负担, 可\n透过此作业来设定合法的使用者.
VB013=1. 查询以及浏览: 相同于一般作业\n2. 新增以及修改:\n   A. 使用者: 直接输入该使用者账号或是开窗选择一合法使用者.
VB014=无
[SMVD]
VB010=无
VB011=新增、修改或删除系统讯息欲显示之讯息，意指所有使用者皆可检视此作\n业新增之系统讯息。
VB012=当有重要讯息要通知所有使用者时，可透过此作业新增系统讯息。\n亦可由此作业了解所有使用者是否被通知及是否已读取讯息内容。
VB013=依照一般维护作业操作流程。
VB014=当此作业新增一笔讯息后，系统自动会在「通知时间」后登入的使用者画\n面左下角出现一小小讯息窗口。
[STDDOCList]
VB010=
VB011=
VB012=
VB013=
VB014=
[SMVQ]
VB010=无
VB011=查询各时间区间所发生的登入纪录统计
VB012=透过此作业可统计不同时间区间/类型等方式所统计出来的登入记录笔数
VB013=分析时间区块:\n请输入查询期间的起迄. 此两字段必填\n\n分析方式区块:\n可采用以下三种区分区块方式:\n1. 时间区隔: 可选择每月, 每日, 每小时, 每分钟做统计单位\n2. 性质分类: 可选择应用程序别, 模块别, 程序别, 使用者, 错误层级做为统\n　　　　　　计单位\n3. SQL语句: 若管理者知道此数据表的结构, 并须根据与上述方式不同的\n　　　　　　分类方法做统计, 则可选择此方式. 此方式的SQL语法下达\n　　　　　　后, 数据集必需包含FLD以及CCS两个字段, 分别为各区间\n　　　　　　(FLD)以及统计值(CCS).\n\n显示方式:\n可选择水平长条图, 垂直长条图, 或是圆饼图
VB014=无
[SinyiInfo]
VB010=
VB011=
VB012=
VB013=
VB014=
[UserSetting]
VB010=无
VB011=主要提供使用者自行设定系统代理人(即代理使用者签核的人)及相关个人\n设定，如：班别设定、工作处理、使用语系……等。
VB012=当您请长假、长期出差…等需启用代理人时，请点选系统选单上的「个人\n设定作业」，系统便会在工作区显示相关设定字段。
VB013=Step1 点选「个人作业区」后，在系统选单中点鼠标左键一下「个人设定\n作业」，即可呈现设定画面。\nStep2 依需要填入字段值后按下『储存设定』钮即可。\n\n※是否收取Email：是否以Email通知代理人开始代理。\n※是否在线实时通知：是否以在线实时通知代理人开始代理。
VB014=代理人又分成「通用代理人」及「流程代理人」（其它特殊代理设定），\n当流程未指定代理人时，则以通用代理为主，譬如：当您请假时，需要您\n签核的流程未设指定代理人时便会送至通用代理人处，由其签核之。反\n之，已设定代理人的流程则会到您已设定的代理人。
[SMWO]
VB010=无
VB011=若使用者在签核窗体时又同时指派了工作「在签核时使用(转派)功能」，这\n些被转派的流程就会放在?已转派工作清单?中。
VB012=当您想重新处理某个已转派的流程工作或查看曾转派的流程时，请点选系\n统选单上的「已转派工作清单」，系统便会在工作区显示您已转派的工作\n事项清单。
VB013=Step1 点选「个人作业区」后，在系统选单中点鼠标左键一下「已转派工\n作清单」，即可呈现已转派工作清单内容，工作区会呈现搜寻与清单画\n面。\nStep2 搜寻可以依照?主旨包含?、?工作建立时间?、「全部、已结案、未\n结案」做搜寻，依需要填入条件后按下『搜寻』钮即可。\nStep3 直接于清单中点选欲检视项目，即可开启检视作业画面。
VB014=系统管理者可设定每个流程是否有「转派、取回」功能，若该流程只允许\n转派、不允许取回，则使用者无法于此取回流程重新处理。
[LoginLog]
VB010=无
VB011=检视使用者登入的纪录.
VB012=透过此作业可以检视各使用者登入的位置以及时间, 同时可操作此纪录.
VB013=搜寻浏览:\nA. 同一般维护作业\nB. 清除所有记录: 按下此钮后会将纪录全部清除\nC. 注记所有未注销信息: 按下此钮会, 系统会将无注销时间的字段填上\n   目前执行时间.\n\n检视:\nA. SessionID: 登入者在服务器对应的SessionID\nB. 使用者代号姓名: 登入者身分\nC. 登入IP: 使用者登入使用的计算机位置\nD. 登入时间: 使用者登入通过验证的时间\nE. 注销时间: 使用者按下注销钮注记的时间, 或是直接关闭窗口后系统\n   自动记录时间.\nF. 验证Hash: 系统内部使用记录
VB014=无
[SinyiSent]
VB010=
VB011=
VB012=
VB013=
VB014=
[ProcessDesigner]
VB010=无
VB011=直接登入流程设计师画面.
VB012=透过此连结可直接登入流程引擎流程设计师功能.
VB013=请参阅流程引擎相关说明文件.
VB014=无
[Webi2423]
VB010=
VB011=
VB012=
VB013=
VB014=
[OrganizationUnitPropertyMaintain]
VB010=无
VB011=检视 Flow Engine(EasyFlow GP) 系统中所设定的部门/项目属性数据，仅\n提供检视，无新增、删除、修改功能。
VB012=若要查询流程设计中部门/项目属性数据，可透过「部门项目属性数据检视\n作业」查询。
VB013=依照一般维护作业操作流程。
VB014=若要新增、删除、修改部门/项目属性数据，可至 Flow Engine(EasyFlow \nGP) 系统中做调整。\n\n※部门/项目属性，部门/项目因为不同的特性可以予以不同属性，例如一级\n研发单位、利润单位．．．等属性。
[SMVEU]
VB010=无
VB011=仅供使用者检视系统公告内容，无新增、删除、修改功能。
VB012=当管理者发布系统公告后，一般使用者可透过此作业检视公告内容。
VB013=Step1 点选「个人作业区」后，在系统选单中点鼠标左键一下「系统公\n告」，即可呈现系统公告清单画面。\nStep2 直接于清单中点选欲检视项目，即可开启检视作业画面。
VB014=并非所有人皆可看到相同的系统公告。\n系统公告可设定发布的对象，一般使用者仅能看到对应的公告项目。
[SMTA]
VB010=无
VB011=提供设定各批次信息：包含批次执行实体路径、执行时间、频率、批次参\n数设定、批次分段执行设定……等。
VB012=当批次开发完成后，可透过「批次代码维护作业」向平台登录需执行的批\n次、批次执行时机…等。
VB013=依照一般维护作业操作流程。\n各字段项目说明：\n一、基本设定页签\n1.完整类别名称：必须设定批次的namespace名称。\n2.分段执行批次作业：必须与程序里所设定的分段作为连结，表示该批次\n是否需要分段执行。如程序里BatchStep变量只设定到1时，此分段执行则\n为否；如设定超过1，则分段执行为是，且批次执行分段数目需一并设定。\n默认值为否。\n3.立即执行：表示批次管理服务启动时，此批次是否需要被立即执行。预\n设值为否。\n4.相依于其它批次作业：此字段不为空值时，表示当此批次作业执行完毕\n后，需立即执行该字段所设定的批次作业。\n5.批次执行失败后动作：表示批次一旦执行失败后，是否需要立即重新执\n行，或是等待下次排程设定的时间才重新执行。默认值为等待下次执行时\n间再执行。\n6.容许批次执行最长时间：表示容许批次一次执行最长的总时间，一旦因\n外力因素导致该批次执行时间超出设定范围，则将该次执行状态更改为执\n行失败。\n7.容许度：表示容许批次开始执行时间与排程设定执行时间的时间差，一\n但超过设定范围，则等待下次执行时间到再执行。\n8.执行排程时间：设定批次执行的时间、频率。\n\n二、参数设定页签\n1.各支批次所需使用的参数设定，在程序里可以利用呼叫AbstractBatch \nclass的StrSetting方法，取得所需变量即可。\n2.参数名称需与批次程序中撰写的相同。\n\n三、批次分段设定页签\n1.批次管理服务会根据此页签所设定的分段，依照分段顺序执行各分段。\n2.Grid的分段数目需与基本设定页签中的批次分段执行数目一致。\n3.分段执行顺序需与程序中所设定分段顺序一致。特别注意的是，批次作\n业中各分段必须确保逻辑上可以分段执行，才可以设定为分段执行。\n4.错误尝试执行次数：表示各分段被允许连续错误次数，一旦错误执行次\n数超过范围，即使排程设定执行时间到了，也不会再次尝试执行该分段。
VB014=若要使用ECP提供之批次管理模块，需另外于「开始→系统管理工具→服\n务」中设定由ECP所提供的批次执行Service。
[InfoView]
VB010=无
VB011=BI工具Webi报表标准使用接口
VB012=当整合BI工具时, 透过此作业可直接登入到BI工具InfoView使用接口
VB013=请参阅BI系统相关说明文件
VB014=此作业必须整合BI工具使用
[SMXD]
VB010=无
VB011=查询各可打印作业画面的打印纪录
VB012=当使用者在作业画面按下[打印凭证]按钮时, 系统会纪录此动作. 若要\n根据不同的作业画面查询各次打印的纪录时, 可透过此作业达成.
VB013=搜寻浏览:\n同一般维护作业操作\n\n检视:\nA. 打印名称: 系统预设名称为[窗体名称] (单号)\nB. 打印次数: 不同使用者打印次数的总和\nC. 打印内容: 代表此作业画面内容的URL\n\n打印纪录:\n相同于[使用者打印查询作业]的检视画面说明.
VB014=此作业以作业画面打印的角度来查询纪录, 若要根据使用者, 请使用\n[使用者打印查询作业].
[APMONEY]
VB010=
VB011=
VB012=
VB013=
VB014=
[BMaintain]
VB010=
VB011=
VB012=
VB013=
VB014=
[SMSF]
VB010=无
VB011=提供查询某程序有使用权限的使用者清单。
VB012=若要查询某程序有那些使用者有使用权限及有那些权限，可透过「程序权\n限查询作业」查询。
VB013=Step1 点选「系统作业区」后，在系统选单中点鼠标左键一下「程序权限\n查询作业」，即工作区会呈现查询与清单画面。\nStep2 查询可以依照?请选择程序名称?、「仅列出拥有任一权限的使用\n者」做搜寻，依需要填入条件后按下『开始查询』钮即可于清单中看到查\n询结果。
VB014=当勾选『仅列出拥有任一权限的使用者』时，如该使用者对所下达条件所\n搜寻出的权限项目都无权限时，该名使用者不会列在清单当中。\n\n※若所查询的程序其有使用权限的使用者数量过多会影响查询效率。
[SMVL]
VB010=无
VB011=事先定义一些常用的词组，方便在输入处理意见时使用，以加快输入的速\n度。
VB012=使用者在签核、重办、转派、取回填写意见时，会一直重复使用一些语\n句，例如：如拟、所请照准…之类的；这时就可以使用「个人词组建立作\n业」来设定这些文字或词组。
VB013=依照一般维护作业操作流程。
VB014=此作业所设定的词组为设定者个人所使用。
[RoleDefinitionMaintain]
VB010=无
VB011=检视 Flow Engine(EasyFlow GP) 系统中所设定的角色定义数据，仅提供\n检视，无新增、删除、修改功能。
VB012=若要查询流程设计中角色定义数据，可透过「角色定义检视作业」查询。
VB013=依照一般维护作业操作流程。
VB014=若要新增、删除、修改角色定义数据，可至 Flow Engine(EasyFlow GP)\n系统中做调整。\n\n※角色定义，根据不同的工作权责可以定义出不同的角色由组织内的人员\n扮演，如部门收发、项目收发等角色。
[OrganizationMaintain]
VB010=无
VB011=检视 Flow Engine(EasyFlow GP) 系统中所设定的组织数据，仅提供检\n视，无新增、删除、修改功能。
VB012=若要查询流程设计中组织数据，可透过「组织数据检视作业」查询。
VB013=Step1 点选「系统作业区」后，在系统选单中点鼠标左键一下「组织数据\n检视作业」，即工作区会呈现组织树及明细画面。\nStep2 于组织树欲看明细数据的部门单位上点鼠标左键一下，即将明细资\n料呈现于右边明细区块。
VB014=若要新增、删除、修改组织数据，可至 Flow Engine(EasyFlow GP)系统中\n做调整。
[GroupsMaintain]
VB010=无
VB011=检视 Flow Engine(EasyFlow GP) 系统中所设定的组织群组数据，仅提供\n检视，无新增、删除、修改功能。
VB012=若要查询流程设计中某群组的成员，可透过「群组数据检视作业」查询。
VB013=依照一般维护作业操作流程。
VB014=若要新增、删除、修改群组数据，可至 Flow Engine(EasyFlow GP) 系统\n中做调整。
